//  Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
// 6 -> да
// 7 -> да
// 1 -> нет

Console.Write("Введите номер дня недели: ");
int number = int.Parse(Console.ReadLine()!);
if (number == 1) {
        Console.WriteLine("Будний день");
}
if (number == 2) {
        Console.WriteLine("Будний день");
}
if (number == 3) {
        Console.WriteLine("Будний день");
}
if (number == 4) {
        Console.WriteLine("Будний день");
}
if (number == 5) {
        Console.WriteLine("Будний день");
}
if (number == 6) {
        Console.WriteLine("Выходной день");
}
if (number == 7) {
        Console.WriteLine("Выходной день");
}